<?php

// ==============================
// DB接続ファイル読み込み
// ==============================
// db.php の getDB() 関数を使うために読み込む
require_once(__DIR__ . "/db.php");

// ==============================
// SQLiteへ接続
// ==============================
// getDB() を実行すると PDO オブジェクトが返る
$pdo = getDB();

// ==============================
// SQL実行
// ==============================
// forms テーブルの全データ取得
$stmt = $pdo->query("
  SELECT *
  FROM forms
");

// ==============================
// データ取得
// ==============================
// fetchAll() で全件取得
// PDO::FETCH_ASSOC にすると
// カラム名ベースの連想配列になる
$data = $stmt->fetchAll(PDO::FETCH_ASSOC);

// ==============================
// 画面表示
// ==============================
// <pre> を使うと配列が見やすく表示される
echo "<pre>";

// print_r() は配列やオブジェクトを表示する関数
print_r($data);

echo "<pre>";